asuFlumeCleanCases/3dAsuFlume_2particle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
 
vertices
(
    // Lower block (0 to 0.1 in y)
    (0 0 0)     
    (3 0 0)     
    (3 0.38 0)   
    (0 0.38 0)   
    (0 0 0.1)  
    (3 0 0.1)  
    (3 0.38 0.1)
    (0 0.38 0.1)

    // Upper block (0.1 to 0.5 in y)
    (0 0.0 0.5)   
    (3 0.0 0.5)   
    (3 0.38 0.5)
    (0 0.38 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 38 10) simpleGrading (1 1 1) // Lower block
    hex (4 5 6 7 8 9 10 11) (300 38 40) simpleGrading (1 1 1) // Upper block
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
    
    groundAndWall
    {
        type wall;
        faces
        (
            (4 8 11 7)
            (5 9 8 4)
	    (6 10 9 5)
	    (7 11 10 6)
            (1 5 4 0)
            (2 6 5 1)
            (3 7 6 2)
            (1 0 3 2)
        );
    }

);


// ************************************************************************* //
