asuFlumeCleanCases/3dAsuFlume_2particle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          380;
        startFace       1681700;
    }
    top
    {
        type            patch;
        nFaces          11400;
        startFace       1682080;
    }
    groundAndWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          44820;
        startFace       1693480;
    }
)

// ************************************************************************* //
