asuFlumeCleanCases/3dAsuFlume_2particle/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
    top
    {
        type            prghPressure;
        p               uniform 100000;
        value           uniform 100000;
        rho             rho;
    }
    groundAndWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
}


// ************************************************************************* //
