asuFlumeCleanCases/3dAsuFlume_2particle/0/k.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      k.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00081;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        U               U.liquid;
        value           uniform 0.00081;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 0.00081;
        value           uniform 0.00081;
    }
    groundAndWall
    {
        type            kqRWallFunction;
        value           uniform 0.00081;
    }
}


// ************************************************************************* //
