asuFlumeCleanCases/3dAsuFlume_2particle/0/ph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      ph;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100149.14;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 100149.14;
    }
    groundAndWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
