asuFlumeCleanCases/3dAsuFlume_2particle/0/ph_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall
    {
        type            fixedFluxPressure;
        value           $internalField;
        //type            zeroGradient;
    }
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
        //type            zeroGradient;
    }
    side
    {
        type            fixedFluxPressure;
        value           $internalField;
        //type            zeroGradient;
    }
    axis
    {
        type            fixedFluxPressure;
        value           $internalField;
        //type            zeroGradient;
    }
    top 
    {
        type            fixedValue;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
